[
  { "word": "RULES",  "def": "Pega rule container" },
  { "word": "AGENT",  "def": "Background processing entity" },
  { "word": "STAGE",  "def": "Case lifecycle stage" },
  { "word": "CLASS",  "def": "Rule or data class" },
  { "word": "PARAM",  "def": "Parameter passed to a rule" },
  { "word": "FIELD",  "def": "Field value rule" },
  { "word": "QUEUE",  "def": "Background item queue" },
  { "word": "EVENT",  "def": "Real-time platform signal" },
  { "word": "TOKEN",  "def": "Authentication token" },
  { "word": "INDEX",  "def": "Optimised table index" },
  { "word": "VALUE",  "def": "Property default-value rule" },
  { "word": "SKILL",  "def": "Operator skill tag" },
  { "word": "ALERT",  "def": "Performance alert log" },
  { "word": "TRACE",  "def": "Live tracer session" },
  { "word": "CACHE",  "def": "Data page cache" },
  { "word": "LOGIN",  "def": "User authentication step" },
  { "word": "CHART",  "def": "Report visualisation" },
  { "word": "DRAFT",  "def": "Draft-mode UI rule" },
  { "word": "EMAIL",  "def": "Email-channel message" },
  { "word": "PAGES",  "def": "Clipboard pages list" },
  { "word": "ABORT", "def": "Terminate a process prematurely before it finishes." },
  { "word": "ACTOR", "def": "Entity (person or system) that participates in or initiates a process." },
  { "word": "ADAPT", "def": "Adjust to new conditions or requirements in a project or system." },
  { "word": "ADMIN", "def": "User with privileges to manage and configure a system or application." },
  { "word": "ADOPT", "def": "Take up or start using something new, such as a technology or practice." },
  { "word": "AGENT", "def": "Background service or process that performs automated tasks on a schedule." },
  { "word": "AGILE", "def": "Software development approach emphasizing flexibility and iterative progress." },
  { "word": "ALARM", "def": "Notification of an urgent issue, prompting immediate attention." },
  { "word": "ALERT", "def": "System-generated warning or notification about a specific condition." },
  { "word": "ALIAS", "def": "Alternate name or shorthand for an object or person in a system." },
  { "word": "ALIGN", "def": "Ensure components or stakeholders are in agreement on goals and approach." },
  { "word": "ALPHA", "def": "Early test version of software with incomplete features." },
  { "word": "ARRAY", "def": "Ordered collection of elements accessed by an index in programming." },
  { "word": "ASSET", "def": "Item of value owned by a person or company, tracked in systems." },
  { "word": "ASYNC", "def": "Not occurring at the same time, allowing processes to run independently." },
  { "word": "AUDIO", "def": "Sound content or signals processed or produced by an application." },
  { "word": "AUDIT", "def": "Systematic record or log of actions for accountability and review." },
  { "word": "AZURE", "def": "Microsoft’s cloud computing platform for deploying applications and services." },
  { "word": "BATCH", "def": "Execution of jobs or tasks in large groups without manual intervention." },
  { "word": "BRAND", "def": "Distinct identity of a product or company, shaped by its name and reputation." },
  { "word": "BREAK", "def": "Pause execution or exit from a loop or process, often used in debugging." },
  { "word": "BUILD", "def": "Compile and assemble code into a working application or component." },
  { "word": "BUYER", "def": "Person or organization that purchases goods or services." },
  { "word": "BYTES", "def": "Units of data, typically groups of 8 bits, used to measure storage or memory." },
  { "word": "CACHE", "def": "Temporary storage that saves recently used data for quicker access." },
  { "word": "CASES", "def": "Instances of work or transactions managed in a workflow application." },
  { "word": "CATCH", "def": "Intercept and handle an error thrown during program execution." },
  { "word": "CHAIN", "def": "Series of connected elements or processes, like steps in a supply sequence." },
  { "word": "CHAMP", "def": "Leading contender in a test, often paired with a “challenger” in experiments." },
  { "word": "CHART", "def": "Visual diagram representing data or information (e.g., bar or pie)." },
  { "word": "CHECK", "def": "Verify correctness or presence of something, often as part of testing." },
  { "word": "CHILD", "def": "Dependent element that derives from a parent entity, such as a sub-case." },
  { "word": "CLAIM", "def": "Request for benefit or payment, especially in insurance or healthcare." },
  { "word": "CLASS", "def": "Blueprint or template defining the structure and behavior of objects." },
  { "word": "CLEAN", "def": "Free of errors or extraneous elements, such as well-prepared data." },
  { "word": "CLEAR", "def": "Remove all contents or reset to an empty or default state." },
  { "word": "CLOSE", "def": "Mark a case or process as completed or no longer active." },
  { "word": "CLOUD", "def": "Infrastructure of remote servers accessed via the internet for data storage and computing." },
  { "word": "COACH", "def": "Mentor or guide who supports a team in improving performance (commonly in Agile)." },
  { "word": "CODER", "def": "One who writes computer programs; a software developer." },
  { "word": "COLOR", "def": "Hue or shade used in design elements, often to improve user experience." },
  { "word": "COSTS", "def": "Expenses or resources required for a project or purchase." },
  { "word": "CRASH", "def": "Abrupt failure of a program or system, causing it to stop working." },
  { "word": "CYBER", "def": "Relating to computers or networks, often used when discussing digital security." },
  { "word": "CYCLE", "def": "Complete series of stages or events that repeat in sequence." },
  { "word": "DEBUG", "def": "Process of identifying and resolving bugs or issues in software." },
  { "word": "DIGIT", "def": "Single numerical character (0–9) used in representing numbers." },
  { "word": "DIRTY", "def": "Marked as modified or unsaved, indicating changes that need saving." },
  { "word": "DRAFT", "def": "Preliminary version of a document or design, subject to change." },
  { "word": "DRILL", "def": "Explore data at deeper levels of detail, as in diving into specifics." },
  { "word": "DUMMY", "def": "Placeholder or sample used during development in place of real data." },
  { "word": "EMAIL", "def": "Electronic message sent over a network, a common communication method in business." },
  { "word": "ENTRY", "def": "Item of data entered into a system, or a record in a list or log." },
  { "word": "EQUAL", "def": "Having the same value or status, often used in comparisons." },
  { "word": "ERROR", "def": "Flaw in software causing incorrect results or failure in execution." },
  { "word": "ETHIC", "def": "Moral principle guiding responsible behavior in technology or business." },
  { "word": "EVENT", "def": "Occurrence or action that triggers processes or responses in a system." },
  { "word": "EXCEL", "def": "Widely used spreadsheet software, often integrated for data export/import." },
  { "word": "FACTS", "def": "Verified pieces of information used as evidence or reference." },
  { "word": "FALSE", "def": "Boolean value indicating a negative or “no” condition." },
  { "word": "FATAL", "def": "Causing a program or process to terminate immediately due to a critical error." },
  { "word": "FETCH", "def": "Retrieve data from a source, such as calling an API or database query." },
  { "word": "FIELD", "def": "Individual data element or input area within a form or record." },
  { "word": "FIXES", "def": "Corrections applied to bugs or issues in software." },
  { "word": "FLEET", "def": "Group of vehicles or resources managed together, common in logistics." },
  { "word": "FLOAT", "def": "Numeric data type for decimals, or to position an element to one side in layout." },
  { "word": "FLOWS", "def": "Process diagrams or paths outlining how work moves through a system." },
  { "word": "FONTS", "def": "Sets of typefaces used in text display for consistent style." },
  { "word": "FORMS", "def": "User interface screens or documents with fields for inputting data." },
  { "word": "FORUM", "def": "Online platform where users discuss topics or ask and answer questions." },
  { "word": "FRAME", "def": "Structural element or outline that contains or supports content." },
  { "word": "FRAUD", "def": "Intentional deception for personal or financial gain, often fought with detection systems." },
  { "word": "GOALS", "def": "Specific objectives or targets that an individual or organization aims to achieve." },
  { "word": "GRADE", "def": "Rank or category assigned based on quality, performance, or other criteria." },
  { "word": "GRANT", "def": "Officially give or allow something, such as permission or funding." },
  { "word": "GRAPH", "def": "Diagram of connected points or nodes showing relationships or data changes." },
  { "word": "GROOM", "def": "Refine and prioritize items (like backlog tasks) in preparation for development." },
  { "word": "GROUP", "def": "Collection of users or items considered as a single unit for organization or access." },
  { "word": "GUARD", "def": "Protective measure to prevent errors or enforce standards (often used with “rails”)." },
  { "word": "HOTEL", "def": "Establishment offering lodging to travelers, often booked through reservation systems." },
  { "word": "IMAGE", "def": "Picture or graphic file used in an interface or processed by a system." },
  { "word": "INBOX", "def": "Personal worklist or mail folder where pending items or messages arrive." },
  { "word": "INDEX", "def": "Database structure that improves lookup speed by organizing data on key fields." },
  { "word": "INPUT", "def": "Data provided to a system or program for processing." },
  { "word": "ISSUE", "def": "Problem or bug that needs to be resolved in a system or project." },
  { "word": "LABEL", "def": "Text caption identifying a field or element in a user interface." },
  { "word": "LANES", "def": "Parallel tracks in a process diagram separating responsibilities or roles." },
  { "word": "LAYER", "def": "Level of abstraction in a system architecture or stack." },
  { "word": "LEADS", "def": "Potential customers or clients that have shown interest, to be pursued by sales." },
  { "word": "LEARN", "def": "Acquire knowledge or skills through study, practice, or experience." },
  { "word": "LEVEL", "def": "Position in a hierarchy or scale, often indicating degree or difficulty." },
  { "word": "LOANS", "def": "Money lent that is expected to be paid back, usually with interest." },
  { "word": "LOCAL", "def": "Relating to a specific machine or environment (as opposed to remote or global)." },
  { "word": "LOGIC", "def": "Set of reasoning steps or rules that determines how decisions are made." },
  { "word": "LOGIN", "def": "Process of entering credentials to gain access to a system." },
  { "word": "LOYAL", "def": "Faithful and committed, as in long-term customers or employees." },
  { "word": "MACRO", "def": "Single command or abbreviation that expands into a set of instructions or operations." },
  { "word": "MERGE", "def": "Combine multiple elements (such as code branches or data sets) into one." },
  { "word": "MICRO", "def": "Very small in scale; often describes extremely granular components in a system architecture." },
  { "word": "MOCKS", "def": "Simulated objects or components used in testing to mimic real ones." },
  { "word": "MODAL", "def": "Pop-up dialog that requires user interaction before returning to main workflow." },
  { "word": "MODEL", "def": "Abstract representation or blueprint, often for a system or predictive algorithm." },
  { "word": "MONEY", "def": "Currency or funds used as a medium of exchange in transactions." },
  { "word": "MUTEX", "def": "Object or mechanism that prevents simultaneous access to a resource (mutual exclusion)." },
  { "word": "NOTES", "def": "Annotations or comments added to provide context or record information." },
  { "word": "OFFER", "def": "Proposal of a product, service, or incentive presented to a customer." },
  { "word": "ORDER", "def": "Request for a product or service, placed by a customer for fulfillment." },
  { "word": "OWNER", "def": "Individual accountable for a task, case, or system resource." },
  { "word": "PAGES", "def": "Sections or screens in an application, or data containers in memory." },
  { "word": "PANEL", "def": "Dedicated section of a user interface or a group discussion on a specific topic." },
  { "word": "PARAM", "def": "Variable used to pass information into a process or function." },
  { "word": "PARSE", "def": "Analyze text or data by breaking it into components that can be used." },
  { "word": "PATCH", "def": "Software update designed to fix bugs or security vulnerabilities." },
  { "word": "PAYER", "def": "Entity responsible for payment, such as an insurer covering a claim." },
  { "word": "PHASE", "def": "Distinct stage of a project or process with specific objectives." },
  { "word": "PHONE", "def": "Voice communication device or channel, often integrated into customer service systems." },
  { "word": "PILOT", "def": "Small-scale trial of a new system or process before full deployment." },
  { "word": "POINT", "def": "Single unit of measurement or detail (e.g., an Agile estimation metric)." },
  { "word": "POOL", "def": "Shared resource group or partition within a workflow or process diagram." },
  { "word": "PRICE", "def": "Assigned cost or monetary value of a product or service." },
  { "word": "PRINT", "def": "Output text or data, typically for display or logging." },
  { "word": "PROXY", "def": "Server or component that acts on behalf of another to forward requests or data." },
  { "word": "PULSE", "def": "Internal feed or stream for collaboration updates within a system." },
  { "word": "QUERY", "def": "Structured request to retrieve or manipulate data from a database." },
  { "word": "QUEUE", "def": "List of items waiting to be processed, typically in order of arrival or priority." },
  { "word": "QUOTE", "def": "Formal statement of price or terms for products or services." },
  { "word": "RAILS", "def": "Guiding tracks that keep development or processes within set boundaries." },
  { "word": "RANGE", "def": "Span between minimum and maximum values, or extent of variation." },
  { "word": "REGEX", "def": "Pattern defined by a regular expression, used for matching strings in text." },
  { "word": "REPLY", "def": "Respond to a message or communication." },
  { "word": "RESET", "def": "Restore settings or data to their initial default state." },
  { "word": "RETRO", "def": "Agile meeting held after a sprint to reflect and plan improvements." },
  { "word": "RETRY", "def": "Attempt an operation again after a failure or error." },
  { "word": "REUSE", "def": "Utilize existing components or resources instead of creating new ones." },
  { "word": "RISKS", "def": "Potential issues or uncertainties that could negatively impact a project." },
  { "word": "ROBOT", "def": "Automated bot or machine that performs tasks without human intervention." },
  { "word": "ROLES", "def": "Defined positions or functions that determine access rights and responsibilities." },
  { "word": "ROUTE", "def": "Send or direct something along a specific path or to a particular destination." },
  { "word": "RULES", "def": "Business logic definitions in a system that determine behavior or outcomes." },
  { "word": "SALES", "def": "Activities related to selling products or services and managing customer relationships." },
  { "word": "SCALE", "def": "Increase size or capacity to handle growing demand or volume." },
  { "word": "SCOPE", "def": "Defined boundaries of a project or process, specifying what’s included and excluded." },
  { "word": "SCORE", "def": "Numerical rating indicating performance, priority, or likelihood (e.g., credit rating)." },
  { "word": "SCRUM", "def": "Agile framework with time-boxed iterations and regular team ceremonies." },
  { "word": "SETUP", "def": "Initial configuration or arrangement needed to prepare a system for use." },
  { "word": "SHAPE", "def": "Graphic element (like an icon) representing a step or control in a process flow." },
  { "word": "SHARE", "def": "Give others access to or use of something, such as information or resources." },
  { "word": "SIGMA", "def": "Sixth letter of the Greek alphabet, commonly used as a symbol in quality management methods." },
  { "word": "SILOS", "def": "Isolated groups or systems that do not effectively communicate or share information." },
  { "word": "SKILL", "def": "Expertise or ability that can be applied to perform tasks or roles." },
  { "word": "SMART", "def": "Automated or intelligent, often describing systems that make decisions on their own." },
  { "word": "SMOKE", "def": "Preliminary test run to catch basic issues before formal testing." },
  { "word": "SPIKE", "def": "Short research or prototyping effort to investigate a solution approach." },
  { "word": "SPLIT", "def": "Divide or break something into separate parts or branches." },
  { "word": "SQUAD", "def": "Small, cross-functional team working together on a project." },
  { "word": "STACK", "def": "Collection of technologies or layers that form a complete platform or solution." },
  { "word": "STAFF", "def": "Employees or personnel collectively within an organization." },
  { "word": "STAGE", "def": "Major phase in a case lifecycle or project, containing related steps." },
  { "word": "STAKE", "def": "Personal or financial interest or share in an endeavor, held by someone involved." },
  { "word": "STALE", "def": "Out-of-date or no longer fresh; data that has not been refreshed recently." },
  { "word": "STATE", "def": "Current condition or status of an object or process at a point in time." },
  { "word": "STATS", "def": "Numerical metrics or data summaries that measure performance or outcomes." },
  { "word": "STEPS", "def": "Individual actions or tasks that are part of a larger process sequence." },
  { "word": "STOCK", "def": "Supply of goods available, or equity shares in a company." },
  { "word": "STORE", "def": "Save data or keep something in a repository for later use." },
  { "word": "STORY", "def": "Brief description of a requirement told from an end-user perspective (Agile context)." },
  { "word": "STUBS", "def": "Minimal placeholder functions or components used to simulate parts of a system during testing." },
  { "word": "STYLE", "def": "Consistent design or formatting conventions applied for a uniform look and feel." },
  { "word": "SUITE", "def": "Collection of related tools or applications offered as a package." },
  { "word": "SUPER", "def": "Prefix indicating elevated privileges or an extreme degree (as in a user with all access)." },
  { "word": "TABLE", "def": "Structured arrangement of data in rows and columns, such as in a spreadsheet." },
  { "word": "TAXES", "def": "Mandatory fees charged by a government on income, sales, etc., calculated by finance systems." },
  { "word": "TEAMS", "def": "Groups of people collaborating together towards a common goal." },
  { "word": "TESTS", "def": "Procedures executed to verify that a system works as intended." },
  { "word": "THEME", "def": "Overall design style or look-and-feel applied across an application." },
  { "word": "THROW", "def": "Explicitly generate an error or exception in a program to signal an issue." },
  { "word": "TIMER", "def": "Mechanism that triggers an action after a specified time interval." },
  { "word": "TOAST", "def": "Brief message that pops up in the UI to notify the user and then fades away." },
  { "word": "TOOLS", "def": "Utilities or software applications used to accomplish development or administrative tasks." },
  { "word": "TRACE", "def": "Detailed log or recording of step-by-step execution flow for debugging." },
  { "word": "TRADE", "def": "Exchange of goods, services, or assets between parties." },
  { "word": "TRAIN", "def": "Teach or instruct people (or in AI, provide data to a model to learn from)." },
  { "word": "TREES", "def": "Hierarchical structures with branches, used to represent data or decisions." },
  { "word": "TREND", "def": "General direction of change or development over time." },
  { "word": "TRIAL", "def": "Test run or evaluation period for a product or solution before full rollout." },
  { "word": "TRUST", "def": "Confidence in the reliability or integrity of a system, product, or team." },
  { "word": "USERS", "def": "Individuals who interact with a system or application to perform tasks." },
  { "word": "VALUE", "def": "Importance, worth, or benefit of something, often measured against cost." },
  { "word": "VAULT", "def": "Secure repository for sensitive information, protected by encryption or access controls." },
  { "word": "VIDEO", "def": "Medium for transmitting moving visual images and sound, used in calls or media playback." },
  { "word": "VISION", "def": "Strategic plan or long-term goal that guides a project or organization." },
  { "word": "VOICE", "def": "Audio-based communication or control interface, such as speech input or output." },
  { "word": "WASTE", "def": "Unnecessary work or resources that do not add value, targeted for elimination." },
  { "word": "WHILE", "def": "Loop that continues executing as long as its condition remains true." },
  { "word": "IDEAS", "def": "Creative concepts or suggestions intended to solve problems or improve outcomes." },
  { "word": "LIMIT", "def": "Maximum boundary or allowed value that should not be exceeded." },
  { "word": "RAPID", "def": "Fast-paced or quick, often describing accelerated development or change." },
  { "word": "SHEET", "def": "Single page of a workbook or document used for organizing information." },
  { "word": "SHELL", "def": "Command-line interface used to enter and execute text-based commands." },
  { "word": "TASKS", "def": "Pieces of work to be completed, often tracked on a to-do list or project plan." },
  { "word": "ACORD", "def": "An insurance industry standard for data exchange (e.g. policy or claims information), often used when integrating with external insurance systems." },
  { "word": "ACTOR", "def": "A participant (person or system) in a business process or use case that interacts with the workflow to achieve an outcome." },
  { "word": "ADMIN", "def": "The superuser role or persona responsible for system settings and maintenance (also the name of the ops-focused studio)." },
  { "word": "AGENT", "def": "Background process running on a schedule to perform automated tasks like updates or notifications." },
  { "word": "AGILE", "def": "An iterative project delivery approach emphasizing flexibility, customer feedback, and incremental improvements." },
  { "word": "ALERT", "def": "System warning or diagnostic message captured in logs when performance issues or errors occur." },
  { "word": "BATCH", "def": "A processing mode where many records are handled in bulk (often on a schedule) rather than in an immediate, real-time manner." },
  { "word": "BLOBS", "def": "Large binary storage fields in the database where the platform serializes entire case contents for flexible data storage." },
  { "word": "BUILD", "def": "The process of assembling and compiling application components into a deployable package or working version of the software." },
  { "word": "CACHE", "def": "Temporary storage of data in memory for quick access on repeat requests, improving performance." },
  { "word": "CARDS", "def": "Visual elements on a portal page that display key case information and actions in a concise, tile-like format." },
  { "word": "CASES", "def": "Work items or business transactions that the platform manages from start to resolution." },
  { "word": "CHART", "def": "Graphical visualization of data (like a bar or pie) used in reports and dashboards for insights." },
  { "word": "CHURN", "def": "Customer attrition or turnover rate; predicting this helps organizations take proactive steps to retain clients." },
  { "word": "CLAIM", "def": "An insurance request for payment or coverage after a loss or incident, frequently managed as a case in insurance applications." },
  { "word": "CLASS", "def": "Abstract container or blueprint in the application hierarchy used to group related cases or rules by type." },
  { "word": "CLOUD", "def": "Off-premises computing where applications run on remote servers in data centers rather than local hardware." },
  { "word": "COVER", "def": "A parent case that encapsulates and tracks a set of related subcases as one unified work item." },
  { "word": "DEBUG", "def": "The act of finding and fixing defects in an application, often by using logs and step-by-step tracing tools to isolate issues." },
  { "word": "DRILL", "def": "To explore deeper into summarized data by clicking through a chart or report to see the underlying detailed information." },
  { "word": "DXAPI", "def": "The platform’s headless Digital Experience interface that allows external front-end applications to work with cases and data via JSON services." },
  { "word": "EMAIL", "def": "Electronic message communications, commonly used as a channel for sending notifications or creating cases from an inbox." },
  { "word": "EMBED", "def": "Inserting the platform’s interface into an external web page or system using a generated snippet." },
  { "word": "EVENT", "def": "A trigger or occurrence that the system detects and can respond to, such as a specific condition being met or an external signal arriving." },
  { "word": "EXCEL", "def": "Spreadsheet software often used to import, export, or manipulate data that the platform can integrate with." },
  { "word": "FIELD", "def": "A single piece of information captured in a form, defined by a property in the application’s data model." },
  { "word": "FILES", "def": "Documents or data stored on a file system that the application can read from or write to through connectors or listeners." },
  { "word": "FLOWS", "def": "Visual process definitions that orchestrate assignments, decisions, and automation in the application." },
  { "word": "FORUM", "def": "The online community site where Pega professionals ask questions, share knowledge, and help each other solve issues." },
  { "word": "FRAUD", "def": "Financial crime or deceit that business systems aim to detect and prevent using rules, analytics, or machine learning models." },
  { "word": "GUARD", "def": "Protective best-practice guidelines in the platform that keep implementations on track and maintain high quality." },
  { "word": "HIPAA", "def": "A US healthcare regulation requiring protection of patient data privacy, influencing compliance and security features in healthcare applications." },
  { "word": "HTTPS", "def": "The secure web protocol used for encrypted data exchange between client and server (indicated by a lock icon in the browser)." },
  { "word": "INDEX", "def": "A secondary record created for faster searching and reporting, mapping key fields to cases or other data for quick lookup." },
  { "word": "INFRA", "def": "The underlying hardware, software, and network resources that support and run the application environment." },
  { "word": "JBOSS", "def": "A Java EE application server (former name of WildFly) used to run the platform’s applications in some on-premise deployments." },
  { "word": "JUNIT", "def": "A unit testing framework for Java that enables automated test execution, often utilized in continuous integration pipelines." },
  { "word": "KAFKA", "def": "A distributed streaming platform used for building real-time data feeds and messaging; often integrated for event processing needs." },
  { "word": "LAYER", "def": "A level of the application structure used to separate and reuse functionality for different contexts (such as organization, division, or product-specific implementations)." },
  { "word": "LEADS", "def": "Unqualified potential customers or opportunities tracked in a CRM application before they are converted into actual sales." },
  { "word": "LINUX", "def": "A popular open-source operating system often used to host enterprise applications like Pega on servers or cloud instances." },
  { "word": "LISTS", "def": "Ordered collections of items of the same type, such as sequences of values or objects stored together." },
  { "word": "LOGIN", "def": "The process of signing into the application, typically by entering credentials or via single sign-on for authentication." },
  { "word": "MAVEN", "def": "A build automation and dependency management tool for Java projects, used to compile and package the application for deployment." },
  { "word": "MERGE", "def": "Combining two development branches or rule sets into one, integrating changes from multiple sources." },
  { "word": "MIXIN", "def": "A reusable style definition in the UI skin that centralizes design settings (like colors or fonts) for consistency across the application." },
  { "word": "MODAL", "def": "A pop-up dialog window in the interface that captures user input or displays information without leaving the current screen." },
  { "word": "MODEL", "def": "A predictive or decision blueprint (often statistical or machine learning) used to anticipate outcomes or suggest actions." },
  { "word": "NEXUS", "def": "A repository manager for software artifacts, often used to store and manage Pega deployment packages and shared libraries." },
  { "word": "NODES", "def": "Individual server instances in a cluster that share the application workload and data in memory." },
  { "word": "NOSQL", "def": "A class of databases that foregoes the traditional relational table structure, allowing flexible schemas and horizontal scaling." },
  { "word": "OAUTH", "def": "An industry-standard protocol for secure delegated authorization, allowing one service to act on a user’s behalf to access another service’s data." },
  { "word": "OFFER", "def": "A recommended action or proposition presented to a customer, often determined by next-best-action logic in marketing or sales." },
  { "word": "ORDER", "def": "A request for products or services (like a purchase) that is processed as a case in sales or fulfillment workflows." },
  { "word": "PARAM", "def": "A dynamic input value passed into a rule or process to influence its behavior at runtime." },
  { "word": "PATCH", "def": "A minor software update or hotfix release that addresses bugs or provides small enhancements without a full version upgrade." },
  { "word": "PCSSA", "def": "The mid-level Pega certification for system architects who have advanced beyond the basic entry-level credential (CSA)." },
  { "word": "PCLSA", "def": "The top-tier Pega architecture certification, demonstrating expert-level design and leadership skills in building applications." },
  { "word": "PULSE", "def": "An internal social feed on a case, allowing team members to collaborate via comments and updates." },
  { "word": "QUEUE", "def": "A holding list for items or tasks waiting to be processed, often used for asynchronous job execution." },
  { "word": "REGEX", "def": "A pattern-matching expression used to validate formats or search within text (for example, in form validations)." },
  { "word": "REUSE", "def": "The practice of building components or rules so they can be utilized in multiple places, reducing duplicate effort and enhancing consistency." },
  { "word": "RETRO", "def": "A meeting held at the end of an Agile sprint where the team reflects on what went well and what could be improved." },
  { "word": "ROLES", "def": "Permission groups assigned to users that determine what parts of the application they can access or modify." },
  { "word": "ROBOT", "def": "An automated software assistant that performs repetitive tasks, either on a user's desktop or unattended on a server." },
  { "word": "ROUTE", "def": "Sending an assignment to a specific user or team based on criteria like availability or expertise." },
  { "word": "SCRUM", "def": "A popular Agile framework structuring work into fixed-length sprints led by a facilitator and featuring daily stand-up meetings." },
  { "word": "SCORE", "def": "A numeric result from an AI model or analysis indicating likelihood or risk, used in automated decisions or next-best-action." },
  { "word": "SHAPE", "def": "Graphical element on a process diagram representing an action, decision, or sub-process in the workflow." },
  { "word": "SLACK", "def": "A widely used team messaging application that can integrate with the platform for notifications or chatbot interactions." },
  { "word": "SONAR", "def": "A code quality inspection tool (often paired with a \"Qube\" dashboard) used to enforce best practices and catch bugs early." },
  { "word": "SPLIT", "def": "A parallel branch in a process flow where multiple paths execute at once before coming back together." },
  { "word": "STUBS", "def": "Placeholder simulations of external services used in testing to mimic responses from systems that aren't available or built yet." },
  { "word": "TABLE", "def": "A structured display of data in rows and columns, commonly seen in user interface grids or representing records in a database." },
  { "word": "TASKS", "def": "Generic units of work to be completed, such as assignments in a case or items on a to-do list for an operator." },
  { "word": "TEAMS", "def": "Microsoft’s collaboration platform for chat and meetings, which can be integrated as a communication channel in customer service cases." },
  { "word": "THEME", "def": "A design template controlling the overall look and feel of the application’s user interface (for example, the modern Cosmos UI)." },
  { "word": "TOGAF", "def": "A framework for enterprise architecture that provides a structured approach to designing and implementing IT systems at a high level." },
  { "word": "TOKEN", "def": "A small piece of data used for authentication or tracking, such as an access key for API calls." },
  { "word": "TRACE", "def": "Step-by-step execution recorder used for debugging, showing each rule fired and action taken." },
  { "word": "VOICE", "def": "The telephone channel for customer service, enabling spoken conversations and often integrated with IVR (phone menus) and speech analytics." },
  { "word": "RISKS", "def": "Potential problems or uncertainties that could threaten a project’s success, identified and mitigated during project planning." }
]
